[Killed] BooleanLiteral
server/browse.ts:16:7
 export const validateBrowsePath = (
   browsePath: string,
 ): Result<string, BrowseError> => {
-  if (!browsePath) {
+  if (browsePath) {
     return err({ type: 'invalid_path', message: 'Browse path is required' });
   }
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:16:7
 export const validateBrowsePath = (
   browsePath: string,
 ): Result<string, BrowseError> => {
-  if (!browsePath) {
+  if (true) {
     return err({ type: 'invalid_path', message: 'Browse path is required' });
   }
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 400 to be 200 // Object.is equality

[Survived] StringLiteral
server/browse.ts:17:49
   browsePath: string,
 ): Result<string, BrowseError> => {
   if (!browsePath) {
-    return err({ type: 'invalid_path', message: 'Browse path is required' });
+    return err({ type: 'invalid_path', message: "" });
   }
 

[Killed] ConditionalExpression
server/browse.ts:20:7
     return err({ type: 'invalid_path', message: 'Browse path is required' });
   }
 
-  if (browsePath.includes('\0')) {
+  if (true) {
     return err({ type: 'invalid_path', message: 'Path contains null bytes' });
   }
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ConditionalExpression
server/browse.ts:20:7
     return err({ type: 'invalid_path', message: 'Browse path is required' });
   }
 
-  if (browsePath.includes('\0')) {
+  if (false) {
     return err({ type: 'invalid_path', message: 'Path contains null bytes' });
   }

[Killed] ObjectLiteral
server/browse.ts:21:16
   }
 
   if (browsePath.includes('\0')) {
-    return err({ type: 'invalid_path', message: 'Path contains null bytes' });
+    return err({});
   }
 
killedBy: validateBrowsePath: rejects unsafe paths rejects null bytes
statusReason: expected undefined to be 'invalid_path' // Object.is equality

[Killed] StringLiteral
server/browse.ts:21:24
   }
 
   if (browsePath.includes('\0')) {
-    return err({ type: 'invalid_path', message: 'Path contains null bytes' });
+    return err({ type: "", message: 'Path contains null bytes' });
   }
 
killedBy: validateBrowsePath: rejects unsafe paths rejects null bytes
statusReason: expected '' to be 'invalid_path' // Object.is equality

[Killed] BlockStatement
server/browse.ts:26:7
 
   // Decode URL-encoded sequences before validation
   let decoded: string;
-  try {
-    decoded = decodeURIComponent(browsePath);
-  } catch {
+  try {} catch {
     return err({ type: 'invalid_path', message: 'Invalid URL encoding' });
   }
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
server/browse.ts:28:11
   let decoded: string;
   try {
     decoded = decodeURIComponent(browsePath);
-  } catch {
-    return err({ type: 'invalid_path', message: 'Invalid URL encoding' });
-  }
+  } catch {}
 
   // Check null bytes after decoding (catches encoded %00)
killedBy: validateBrowsePath: rejects unsafe paths rejects malformed URL encoding
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
server/browse.ts:33:31
   }
 
   // Check null bytes after decoding (catches encoded %00)
-  if (decoded.includes('\0')) {
-    return err({ type: 'invalid_path', message: 'Path contains null bytes' });
-  }
+  if (decoded.includes('\0')) {}
 
   // Check for traversal sequences after decoding
killedBy: validateBrowsePath: rejects unsafe paths rejects URL-encoded null bytes (%00)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:33:7
   }
 
   // Check null bytes after decoding (catches encoded %00)
-  if (decoded.includes('\0')) {
+  if (true) {
     return err({ type: 'invalid_path', message: 'Path contains null bytes' });
   }
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
server/browse.ts:34:16
 
   // Check null bytes after decoding (catches encoded %00)
   if (decoded.includes('\0')) {
-    return err({ type: 'invalid_path', message: 'Path contains null bytes' });
+    return err({});
   }
 
killedBy: validateBrowsePath: rejects unsafe paths rejects URL-encoded null bytes (%00)
statusReason: expected undefined to be 'invalid_path' // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:38:7
   }
 
   // Check for traversal sequences after decoding
-  if (decoded.includes('..')) {
+  if (true) {
     return err({ type: 'invalid_path', message: 'Path traversal is not allowed' });
   }
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
server/browse.ts:38:31
   }
 
   // Check for traversal sequences after decoding
-  if (decoded.includes('..')) {
-    return err({ type: 'invalid_path', message: 'Path traversal is not allowed' });
-  }
+  if (decoded.includes('..')) {}
 
   if (!path.isAbsolute(decoded)) {
killedBy: validateBrowsePath: rejects unsafe paths rejects dot-dot traversal sequences
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
server/browse.ts:39:24
 
   // Check for traversal sequences after decoding
   if (decoded.includes('..')) {
-    return err({ type: 'invalid_path', message: 'Path traversal is not allowed' });
+    return err({ type: "", message: 'Path traversal is not allowed' });
   }
 
killedBy: validateBrowsePath: rejects unsafe paths rejects dot-dot traversal sequences
statusReason: expected '' to be 'invalid_path' // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:42:7
     return err({ type: 'invalid_path', message: 'Path traversal is not allowed' });
   }
 
-  if (!path.isAbsolute(decoded)) {
+  if (false) {
     return err({ type: 'invalid_path', message: 'Path must be absolute' });
   }
killedBy: GET /api/browse returns 400 for invalid path
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BooleanLiteral
server/browse.ts:42:7
     return err({ type: 'invalid_path', message: 'Path traversal is not allowed' });
   }
 
-  if (!path.isAbsolute(decoded)) {
+  if (path.isAbsolute(decoded)) {
     return err({ type: 'invalid_path', message: 'Path must be absolute' });
   }
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
server/browse.ts:43:49
   }
 
   if (!path.isAbsolute(decoded)) {
-    return err({ type: 'invalid_path', message: 'Path must be absolute' });
+    return err({ type: 'invalid_path', message: "" });
   }
 

[Killed] ArrowFunction
server/browse.ts:54:39
  *
  * Pure function — no filesystem access.
  */
-export const filterDirectoryEntries = (
-  entries: ReadonlyArray<DirEntry>,
-): BrowseEntry[] =>
-  entries
-    .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
-    .map(({ name, path }) => ({ name, path }))
-    .sort((a, b) => a.name.localeCompare(b.name));
+export const filterDirectoryEntries = () => undefined;
 
 /**
killedBy: listDirectories: reads filesystem and returns filtered directory entries returns sorted non-hidden directories from a valid path
statusReason: expected undefined to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] MethodExpression
server/browse.ts:57:3
 export const filterDirectoryEntries = (
   entries: ReadonlyArray<DirEntry>,
 ): BrowseEntry[] =>
-  entries
-    .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
+  entries
     .map(({ name, path }) => ({ name, path }))
     .sort((a, b) => a.name.localeCompare(b.name));
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: expected [ { name: '.hidden', …(1) }, …(3) ] to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] MethodExpression
server/browse.ts:57:3
 export const filterDirectoryEntries = (
   entries: ReadonlyArray<DirEntry>,
 ): BrowseEntry[] =>
-  entries
-    .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
-    .map(({ name, path }) => ({ name, path }))
-    .sort((a, b) => a.name.localeCompare(b.name));
+  entries.filter(entry => entry.isDirectory && !entry.name.startsWith('.')).map(({
+  name,
+  path
+}) => ({
+  name,
+  path
+}));
 
 /**
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: expected [ { name: 'zebra', …(1) }, …(1) ] to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] LogicalOperator
server/browse.ts:58:24
   entries: ReadonlyArray<DirEntry>,
 ): BrowseEntry[] =>
   entries
-    .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
+    .filter((entry) => entry.isDirectory || !entry.name.startsWith('.'))
     .map(({ name, path }) => ({ name, path }))
     .sort((a, b) => a.name.localeCompare(b.name));
killedBy: listDirectories: reads filesystem and returns filtered directory entries returns sorted non-hidden directories from a valid path
statusReason: expected [ { name: '.hidden', …(1) }, …(3) ] to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] MethodExpression
server/browse.ts:58:46
   entries: ReadonlyArray<DirEntry>,
 ): BrowseEntry[] =>
   entries
-    .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
+    .filter((entry) => entry.isDirectory && !entry.name.endsWith('.'))
     .map(({ name, path }) => ({ name, path }))
     .sort((a, b) => a.name.localeCompare(b.name));
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: expected [ { name: '.hidden', …(1) }, …(2) ] to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] ArrowFunction
server/browse.ts:59:10
 ): BrowseEntry[] =>
   entries
     .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
-    .map(({ name, path }) => ({ name, path }))
+    .map(() => undefined)
     .sort((a, b) => a.name.localeCompare(b.name));
 
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: expected [ undefined, undefined ] to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] ObjectLiteral
server/browse.ts:59:31
 ): BrowseEntry[] =>
   entries
     .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
-    .map(({ name, path }) => ({ name, path }))
+    .map(({ name, path }) => ({}))
     .sort((a, b) => a.name.localeCompare(b.name));
 
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ArrowFunction
server/browse.ts:60:11
   entries
     .filter((entry) => entry.isDirectory && !entry.name.startsWith('.'))
     .map(({ name, path }) => ({ name, path }))
-    .sort((a, b) => a.name.localeCompare(b.name));
+    .sort(() => undefined);
 
 /**
killedBy: browse pipeline: validate path and filter directory entries validates a safe absolute path and filters entries to sorted directories only
statusReason: expected [ { name: 'zebra', …(1) }, …(1) ] to deeply equal [ { name: 'alpha', …(1) }, …(1) ]

[Killed] BlockStatement
server/browse.ts:71:51
  */
 export const listDirectories = async (
   dirPath: string,
-): Promise<Result<BrowseEntry[], BrowseError>> => {
-  try {
-    const dirents = await readdir(dirPath, { withFileTypes: true });
-    const entries: DirEntry[] = dirents.map((dirent) => ({
-      name: dirent.name,
-      path: path.join(dirPath, dirent.name),
-      isDirectory: dirent.isDirectory(),
-    }));
-    return ok(filterDirectoryEntries(entries));
-  } catch (error: unknown) {
-    const nodeError = error as NodeJS.ErrnoException;
-    if (nodeError.code === 'ENOENT') {
-      return err({ type: 'not_found', path: dirPath });
-    }
-    if (nodeError.code === 'EACCES') {
-      return err({ type: 'permission_denied', path: dirPath });
-    }
-    return err({ type: 'read_failed', message: nodeError.message ?? 'Unknown read error' });
-  }
-};
+): Promise<Result<BrowseEntry[], BrowseError>> => {};
 
 /**
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
server/browse.ts:72:7
 export const listDirectories = async (
   dirPath: string,
 ): Promise<Result<BrowseEntry[], BrowseError>> => {
-  try {
-    const dirents = await readdir(dirPath, { withFileTypes: true });
-    const entries: DirEntry[] = dirents.map((dirent) => ({
-      name: dirent.name,
-      path: path.join(dirPath, dirent.name),
-      isDirectory: dirent.isDirectory(),
-    }));
-    return ok(filterDirectoryEntries(entries));
-  } catch (error: unknown) {
+  try {} catch (error: unknown) {
     const nodeError = error as NodeJS.ErrnoException;
     if (nodeError.code === 'ENOENT') {
killedBy: listDirectories: reads filesystem and returns filtered directory entries returns sorted non-hidden directories from a valid path
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BooleanLiteral
server/browse.ts:73:61
   dirPath: string,
 ): Promise<Result<BrowseEntry[], BrowseError>> => {
   try {
-    const dirents = await readdir(dirPath, { withFileTypes: true });
+    const dirents = await readdir(dirPath, { withFileTypes: false });
     const entries: DirEntry[] = dirents.map((dirent) => ({
       name: dirent.name,
killedBy: listDirectories: reads filesystem and returns filtered directory entries returns sorted non-hidden directories from a valid path
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
server/browse.ts:73:44
   dirPath: string,
 ): Promise<Result<BrowseEntry[], BrowseError>> => {
   try {
-    const dirents = await readdir(dirPath, { withFileTypes: true });
+    const dirents = await readdir(dirPath, {});
     const entries: DirEntry[] = dirents.map((dirent) => ({
       name: dirent.name,
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
server/browse.ts:74:45
 ): Promise<Result<BrowseEntry[], BrowseError>> => {
   try {
     const dirents = await readdir(dirPath, { withFileTypes: true });
-    const entries: DirEntry[] = dirents.map((dirent) => ({
-      name: dirent.name,
-      path: path.join(dirPath, dirent.name),
-      isDirectory: dirent.isDirectory(),
-    }));
+    const entries: DirEntry[] = dirents.map(() => undefined);
     return ok(filterDirectoryEntries(entries));
   } catch (error: unknown) {
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
server/browse.ts:74:58
 ): Promise<Result<BrowseEntry[], BrowseError>> => {
   try {
     const dirents = await readdir(dirPath, { withFileTypes: true });
-    const entries: DirEntry[] = dirents.map((dirent) => ({
-      name: dirent.name,
-      path: path.join(dirPath, dirent.name),
-      isDirectory: dirent.isDirectory(),
-    }));
+    const entries: DirEntry[] = dirents.map((dirent) => ({}));
     return ok(filterDirectoryEntries(entries));
   } catch (error: unknown) {
killedBy: Multi-project end-to-end integration should return directory listing from browse endpoint via real filesystem
statusReason: expected [] to include 'project-alpha'

[Killed] BlockStatement
server/browse.ts:80:28
       isDirectory: dirent.isDirectory(),
     }));
     return ok(filterDirectoryEntries(entries));
-  } catch (error: unknown) {
-    const nodeError = error as NodeJS.ErrnoException;
-    if (nodeError.code === 'ENOENT') {
-      return err({ type: 'not_found', path: dirPath });
-    }
-    if (nodeError.code === 'EACCES') {
-      return err({ type: 'permission_denied', path: dirPath });
-    }
-    return err({ type: 'read_failed', message: nodeError.message ?? 'Unknown read error' });
-  }
+  } catch (error: unknown) {}
 };
 
killedBy: listDirectories: maps filesystem errors to BrowseError returns not_found for non-existent directory
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
server/browse.ts:82:9
     return ok(filterDirectoryEntries(entries));
   } catch (error: unknown) {
     const nodeError = error as NodeJS.ErrnoException;
-    if (nodeError.code === 'ENOENT') {
+    if (nodeError.code !== 'ENOENT') {
       return err({ type: 'not_found', path: dirPath });
     }
killedBy: listDirectories: maps filesystem errors to BrowseError returns not_found for non-existent directory
statusReason: expected 'read_failed' to be 'not_found' // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:82:9
     return ok(filterDirectoryEntries(entries));
   } catch (error: unknown) {
     const nodeError = error as NodeJS.ErrnoException;
-    if (nodeError.code === 'ENOENT') {
+    if (false) {
       return err({ type: 'not_found', path: dirPath });
     }
killedBy: listDirectories: maps filesystem errors to BrowseError returns not_found for non-existent directory
statusReason: expected 'read_failed' to be 'not_found' // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:85:9
     if (nodeError.code === 'ENOENT') {
       return err({ type: 'not_found', path: dirPath });
     }
-    if (nodeError.code === 'EACCES') {
+    if (true) {
       return err({ type: 'permission_denied', path: dirPath });
     }
killedBy: listDirectories: maps filesystem errors to BrowseError returns read_failed for a file path instead of directory
statusReason: expected 'permission_denied' to be 'read_failed' // Object.is equality

[Killed] EqualityOperator
server/browse.ts:85:9
     if (nodeError.code === 'ENOENT') {
       return err({ type: 'not_found', path: dirPath });
     }
-    if (nodeError.code === 'EACCES') {
+    if (nodeError.code !== 'EACCES') {
       return err({ type: 'permission_denied', path: dirPath });
     }
killedBy: listDirectories: maps filesystem errors to BrowseError returns permission_denied for inaccessible directory
statusReason: expected 'read_failed' to be 'permission_denied' // Object.is equality

[Killed] ObjectLiteral
server/browse.ts:86:18
       return err({ type: 'not_found', path: dirPath });
     }
     if (nodeError.code === 'EACCES') {
-      return err({ type: 'permission_denied', path: dirPath });
+      return err({});
     }
     return err({ type: 'read_failed', message: nodeError.message ?? 'Unknown read error' });
killedBy: listDirectories: maps filesystem errors to BrowseError returns permission_denied for inaccessible directory
statusReason: expected undefined to be 'permission_denied' // Object.is equality

[Survived] LogicalOperator
server/browse.ts:88:48
     if (nodeError.code === 'EACCES') {
       return err({ type: 'permission_denied', path: dirPath });
     }
-    return err({ type: 'read_failed', message: nodeError.message ?? 'Unknown read error' });
+    return err({ type: 'read_failed', message: nodeError.message && 'Unknown read error' });
   }
 };

[Killed] BlockStatement
server/browse.ts:97:70
  *
  * Pure function — no filesystem access.
  */
-export const computeParentPath = (dirPath: string): string | null => {
-  const parent = path.dirname(dirPath);
-  return parent === dirPath ? null : parent;
-};
+export const computeParentPath = (dirPath: string): string | null => {};
 
 /**
killedBy: computeParentPath: computes parent or null for filesystem root returns parent directory for a nested path
statusReason: expected undefined to be '/home/user' // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:99:10
  */
 export const computeParentPath = (dirPath: string): string | null => {
   const parent = path.dirname(dirPath);
-  return parent === dirPath ? null : parent;
+  return true ? null : parent;
 };
 
killedBy: computeParentPath: computes parent or null for filesystem root returns parent directory for a nested path
statusReason: expected null to be '/home/user' // Object.is equality

[Killed] ConditionalExpression
server/browse.ts:99:10
  */
 export const computeParentPath = (dirPath: string): string | null => {
   const parent = path.dirname(dirPath);
-  return parent === dirPath ? null : parent;
+  return false ? null : parent;
 };
 
killedBy: computeParentPath: computes parent or null for filesystem root returns null for filesystem root
statusReason: expected '/' to be null

[Killed] ArrowFunction
server/browse.ts:105:28
 /**
  * Return the default browse path (user's home directory).
  */
-export const defaultPath = (): string => homedir();
+export const defaultPath = () => undefined;
 
killedBy: defaultPath: returns home directory value returns the same value as os.homedir()
statusReason: expected undefined to be '/Users/andres.dandrea' // Object.is equality
